app/controllers/lists_controller.rb

  def create
    # we need to create our instance with our STRONG params
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "totoro"], ["created_at", "2024-05-09 12:59:20.148809"], ["updated_at", "2024-05-09 12:59:20.148809"]]